app/views/classrooms/show.html.erb

SELECT COUNT(*) FROM "students" WHERE "students"."classroom_id" = 1
---

<%= page_header @classroom.name, eyebrow: [ "Turma", @classroom.school_year ].compact.join(" · "), subtitle: pluralize(@classroom.students.size, "aluno") do %>