app/views/students/_form.html.erb

SELECT "classrooms".* FROM "classrooms" ORDER BY "classrooms"."name" ASC
---
      <%= f.label :classroom_id, class: "label" %>
      <%= f.collection_select :classroom_id, Classroom.order(:name), :id, :display_name,
            { include_blank: "Selecione…" }, class: "input" %>