app/controllers/answer_keys_controller.rb

  def edit
    @questions_by_subject = @exam.questions.includes(exam_subject: :subject).group_by(&:exam_subject)
---
SELECT "exam_subjects".* FROM "exam_subjects" WHERE "exam_subjects"."id" IN (3, 4)
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" IN (3, 2)

  def update
    ExamQuestion.transaction do
      params.fetch(:questions, {}).each do |id, attrs|
        @exam.questions.find(id).update!(
          correct_option: attrs[:correct_option],
          annulled: attrs[:annulled] == "1"
        )
---
UPDATE "exam_questions" SET "correct_option" = 'A', "annulled" = TRUE, "updated_at" = '2026-10-04 02:04:57.602500' WHERE "exam_questions"."id" = 21

  def set_exam
    @exam = Exam.find(params[:exam_id])
---
SELECT "exams".* FROM "exams" WHERE "exams"."id" = 2 LIMIT 1