app/controllers/classrooms_controller.rb

SELECT "classrooms".* FROM "classrooms" ORDER BY "classrooms"."school_year" DESC, "classrooms"."name" ASC
---
  def index
    @classrooms = Classroom.order(school_year: :desc, name: :asc).includes(:students)

SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = 1 LIMIT 1
---
  def set_classroom
    @classroom = Classroom.find(params[:id])