app/controllers/exams_controller.rb

SELECT "exam_classrooms".* FROM "exam_classrooms" WHERE "exam_classrooms"."exam_id" IN (2, 1)
SELECT "exams".* FROM "exams" ORDER BY "exams"."applied_on" DESC, "exams"."created_at" DESC
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" IN (1, 3, 2)
---
  def index
    @exams = Exam.includes(:classrooms, :questions, exam_subjects: :subject).order(applied_on: :desc, created_at: :desc)

INSERT INTO "exams" ("title", "applied_on", "options_count", "created_at", "updated_at") VALUES ('Simulado teste', '2026-10-03', 5, '2026-10-04 02:04:50.708660', '2026-10-04 02:04:50.708660') RETURNING "id"
---
  def create
    @exam = Exam.new(exam_params)
    if @exam.save

SELECT "exams".* FROM "exams" WHERE "exams"."id" = 2 LIMIT 1
---
  def set_exam
    @exam = Exam.find(params[:id])

SELECT "subjects".* FROM "subjects" ORDER BY "subjects"."name" ASC
SELECT "classrooms".* FROM "classrooms" ORDER BY "classrooms"."school_year" DESC, "classrooms"."name" ASC
---
  def load_form_options
    @subjects = Subject.order(:name)
    @classrooms = Classroom.order(school_year: :desc, name: :asc)