app/controllers/students_controller.rb

  def index
    @classrooms = Classroom.order(:name)
    @students = Student.includes(:classroom).order(:name)
    @students = @students.where(classroom_id: params[:classroom_id]) if params[:classroom_id].present?
---
SELECT "classrooms".* FROM "classrooms" ORDER BY "classrooms"."name" ASC
SELECT "students".* FROM "students" WHERE (students.name ILIKE '%an%') ORDER BY "students"."name" ASC
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = 1
SELECT 1 AS one FROM "students" WHERE (students.name ILIKE '%an%') LIMIT 1