app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.order(:name)
---
SELECT "subjects".* FROM "subjects" ORDER BY "subjects"."name" ASC

  def set_subject
    @subject = Subject.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = 1 LIMIT 1