app/models/exam.rb

UPDATE "exam_questions" SET number = -number WHERE ("exam_questions"."id") IN (SELECT "exam_questions"."id" FROM "exam_questions" WHERE "exam_questions"."exam_id" = 1 ORDER BY "exam_questions"."number" ASC)
SELECT "exam_questions".* FROM "exam_questions" WHERE "exam_questions"."exam_id" = 1 ORDER BY "exam_questions"."number" ASC
INSERT INTO "exam_questions" ("exam_id", "exam_subject_id", "number", "correct_option", "annulled", "created_at", "updated_at") VALUES (1, 1, 1, NULL, FALSE, '2026-10-04 02:02:21.681817', '2026-10-04 02:02:21.681817') RETURNING "id"
---
  def sync_questions!
    transaction do
      existing = questions.reload.group_by(&:exam_subject_id)
      # números temporários negativos para não violar o índice único durante a renumeração
      questions.update_all("number = -number")

      number = 0
      exam_subjects.reload.each do |exam_subject|
        current = (existing[exam_subject.id] || []).sort_by(&:number)
        current.drop(exam_subject.questions_count).each(&:destroy!)

        exam_subject.questions_count.times do |i|
          number += 1
          if (question = current[i])
            question.update_columns(number: number)
          else
            questions.create!(exam_subject: exam_subject, number: number)