app/views/exams/index.html.erb

SELECT "exam_classrooms".* FROM "exam_classrooms" WHERE "exam_classrooms"."exam_id" IN (2, 1)
---
        <p class="mt-1 text-sm text-gray-500">
          <%= exam.classrooms.map(&:name).to_sentence.presence || "Sem turma" %> ·

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" IN (1, 3, 2)
---
        </p>
        <p class="mt-2 text-sm text-gray-700"><%= exam.exam_subjects.map { |s| s.subject.name }.join(", ") %></p>