app/views/exams/show.html.erb

SELECT "classrooms".* FROM "classrooms" INNER JOIN "exam_classrooms" ON "classrooms"."id" = "exam_classrooms"."classroom_id" WHERE "exam_classrooms"."exam_id" = 2
---
<% content_for :title, @exam.title %>
<% subtitle = [ (l(@exam.applied_on) if @exam.applied_on), @exam.classrooms.map(&:name).to_sentence.presence ].compact.join(" · ") %>

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" IN (3, 2)
---
    <tbody class="divide-y divide-gray-100">
      <% @exam.exam_subjects.includes(:subject, :questions).each do |exam_subject| %>

SELECT "exam_questions".* FROM "exam_questions" WHERE "exam_questions"."exam_subject_id" IN (3, 4) ORDER BY "exam_questions"."number" ASC
---
          <td class="px-4 py-3 text-gray-600">
            <%= exam_subject.questions.first&.number %>–<%= exam_subject.questions.last&.number %>